{
  "0.4.3": {
    "en": "Fixed onSettings handler using deferred processing pattern to prevent Homey timeout issues. Test simulation now works without previously received metrics (generates test data). Improved error handling and logging for simulation mode. Enhanced README documentation with test mode and detailed settings guide.",
    "nl": "onSettings handler gefixeerd met deferred processing patroon om Homey timeout-problemen te voorkomen. Testsimulatie werkt nu zonder eerder ontvangen metrieken (genereert testgegevens). Verbeterde foutafhandeling en logging voor simulatiemodus. Verbeterde README-documentatie met testmodus en gedetailleerde instellingengids."
  },
  "0.4.2": {
    "en": "Added metrics persistence for restart resilience and test simulation mode. Metrics now survive app restarts/updates. Added TEST SIMULATION for live measurements without API calls for testing and debugging.",
    "nl": "Metrieke persistentie voor restart-resistentie en test simulatiemodus toegevoegd. Metrieken overleven nu app-herstart/updates. TEST SIMULATIE voor live metingen zonder API-aanroepen toegevoegd voor testen en debugging."
  },
  "0.4.1": {
    "en": "Fixed pairing process by implementing proper Homey pairing flow. Enhanced logging and error handling during device configuration.",
    "nl": "Paringsproces gefixeerd door implementatie van juiste Homey pairing flow. Verbeterde logging en foutafhandeling tijdens apparaatconfiguratie."
  },
  "0.4.0": {
    "en": "Added countdown timer for scheduled measurements. Simplified measurements sending to scheduled-only approach. Added separate sensors for API-provided battery metrics. Improved data persistence across app updates.",
    "nl": "Afteltimer voor geplande metingen toegevoegd. Vereenvoudigde metingverzending naar alleen geplande aanpak. Afzonderlijke sensoren voor door API verstrekte batterijeigenschappen toegevoegd. Verbeterde gegevenspersistentie over app-updates."
  },
  "0.3.0": {
    "en": "Added Onbalansmarkt profile polling for user rankings (overall rank and provider rank). Configurable poll interval for automatic ranking updates.",
    "nl": "Polling van Onbalansmarkt profielgegevens voor gebruikersranglijsten (algehele positie en leverancier positie) toegevoegd. Configureerbare poll interval voor automatische ranglijstupdates."
  },
  "0.2.0": {
    "en": "Fixed linting errors, added skip zero results setting, improved asset structure. Removed unused Frank Energie assets, added onUninit() cleanup handler, updated documentation.",
    "nl": "Linting fouten opgelost, instelling voor nulresultaten toegevoegd, verbeterde assetstructuur. Ongebruikte Frank Energie-assets verwijderd, onUninit() cleanup handler toegevoegd, documentatie bijgewerkt."
  },
  "0.1.0": {
    "en": "Initial release with Zonneplan battery flow-card integration and Onbalansmarkt support",
    "nl": "Eerste release met Zonneplan batterij flow-card integratie en Onbalansmarkt ondersteuning"
  }
}
